In [128]:
import pandas as pd

In [129]:
P1 = {"Student": ["Rohit","Rohan","Vishal"],
         "Class": ["8th","8th","8th"],
         "Roll NO.":[1,2,3]}

In [176]:
df = pd.DataFrame(P1)

In [177]:
df

  Student Class  Roll NO.
0   Rohit   8th         1
1   Rohan   8th         2
2  Vishal   8th         3

In [178]:
 df.shape

(3, 3)

In [179]:
df.info

<bound method DataFrame.info of   Student Class  Roll NO.
0   Rohit   8th         1
1   Rohan   8th         2
2  Vishal   8th         3>

In [180]:
df.count()

Student     3
Class       3
Roll NO.    3
dtype: int64

In [181]:
df

  Student Class  Roll NO.
0   Rohit   8th         1
1   Rohan   8th         2
2  Vishal   8th         3

In [182]:
new_P1 = {"Student": ["Palak", "Payal"],
            "Class": ["8th","8th"],
         "Roll NO.":[4,5,]}

In [183]:
new_df = pd.DataFrame(new_P1)

In [187]:
NDF = df.append(new_df)

In [188]:
NDF['Group'] = 'A'

In [189]:
NDF

  Student Class  Roll NO. Group
0   Rohit   8th         1     A
1   Rohan   8th         2     A
2  Vishal   8th         3     A
0   Palak   8th         4     A
1   Payal   8th         5     A

In [190]:
NDF.T

              0      1       2      0      1
Student   Rohit  Rohan  Vishal  Palak  Payal
Class       8th    8th     8th    8th    8th
Roll NO.      1      2       3      4      5
Group         A      A       A      A      A

In [193]:
NDF['Grade'] = 'C'

In [195]:
NDF.T

              0      1       2      0      1
Student   Rohit  Rohan  Vishal  Palak  Payal
Class       8th    8th     8th    8th    8th
Roll NO.      1      2       3      4      5
Group         A      A       A      A      A
Grade         C      C       C      C      C

In [196]:
NDF

  Student Class  Roll NO. Group Grade
0   Rohit   8th         1     A     C
1   Rohan   8th         2     A     C
2  Vishal   8th         3     A     C
0   Palak   8th         4     A     C
1   Payal   8th         5     A     C

In [202]:
NDF[NDF['Group']=='A']

  Student Class  Roll NO. Group Grade
0   Rohit   8th         1     A     C
1   Rohan   8th         2     A     C
2  Vishal   8th         3     A     C
0   Palak   8th         4     A     C
1   Payal   8th         5     A     C

In [210]:
NDF(NDF['Group'].str.replace("A", "B"))

TypeError: 'DataFrame' object is not callable

In [208]:
NEW

0    B
1    B
2    B
0    B
1    B
Name: Group, dtype: object